
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hawk0616/recruit-service-board-infla/actions/runs/6368459553)



<pre><code>Apply complete! Resources: 58 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
data.aws_iam_policy_document.ssm_get_parameter: Reading...
data.aws_iam_policy_document.ecs_assume: Reading...
data.aws_ssm_parameter.rds_password: Reading...
data.aws_iam_policy_document.ecs_task_assume: Reading...
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.lambda_assume: Reading...
data.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.ssm_get_parameter: Read complete after 0s [id=3537814278]
data.aws_iam_policy_document.lambda_assume: Read complete after 0s [id=2690255455]
data.aws_ssm_parameter.rds_password: Read complete after 1s [id=/recruit-service-board/rds/password]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_deployment.deployment will be created
  + resource "aws_api_gateway_deployment" "deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "prod"
    }

  # aws_api_gateway_integration.integration will be created
  + resource "aws_api_gateway_integration" "integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_method.method will be created
  + resource "aws_api_gateway_method" "method" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_resource.resource will be created
  + resource "aws_api_gateway_resource" "resource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "migrate"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.api will be created
  + resource "aws_api_gateway_rest_api" "api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "API for triggering lambda"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "recruit-service-board-api"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)
    }

  # aws_cloudwatch_log_group.cloudwatch_log_group will be created
  + resource "aws_cloudwatch_log_group" "cloudwatch_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/recruit-service-board"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_db_instance.my_db_instance will be created
  + resource "aws_db_instance" "my_db_instance" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "mydb"
      + db_subnet_group_name                  = "recruit-service-board-db-subnet-group"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "5.7"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "default.mysql5.7"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp2"
      + tags                                  = {
          + "Name" = "recruit-service-board RDS Instance"
        }
      + tags_all                              = {
          + "Name" = "recruit-service-board RDS Instance"
        }
      + timezone                              = (known after apply)
      + username                              = "admin"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_subnet_group.my_db_subnet_group will be created
  + resource "aws_db_subnet_group" "my_db_subnet_group" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "recruit-service-board-db-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "recruit-service-board-db-subnet-group"
        }
      + tags_all                = {
          + "Name" = "recruit-service-board-db-subnet-group"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "recruit-service-board"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "recruit-service-board"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "recruit-service-board"
      + tags_all = (known after apply)
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "recruit-service-board"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "recruit-service-board"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "HEALTH_CHECK_PATH"
                          + value = "/health_checks"
                        },
                      + {
                          + name  = "NGINX_PORT"
                          + value = "8080"
                        },
                    ]
                  + image            = "medpeer/health_check:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/recruit-service-board"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "recruit-service-board"
                        }
                    }
                  + name             = "recruit-service-board"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "recruit-service-board"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
    }

  # aws_iam_policy.ssm_get_parameter will be created
  + resource "aws_iam_policy" "ssm_get_parameter" {
      + arn         = (known after apply)
      + description = "Allows access to SSM GetParameter"
      + id          = (known after apply)
      + name        = "recruit-service-board-ssm-get-parameter"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ssm:GetParameter"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:ap-northeast-1:113713103169:parameter//recruit-service-board/rds/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.ecs will be created
  + resource "aws_iam_role" "ecs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "recruit-service-board-ecs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "recruit-service-board-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.lambda_execution_role will be created
  + resource "aws_iam_role" "lambda_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "recruit-service-board-lambda-execution"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_basic will be created
  + resource "aws_iam_role_policy_attachment" "ecs_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "recruit-service-board-ecs"
    }

  # aws_iam_role_policy_attachment.ecs_task_ssm_get_parameter will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_ssm_get_parameter" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "recruit-service-board-ecs-task"
    }

  # aws_iam_role_policy_attachment.lambda_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "lambda_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "recruit-service-board-lambda-execution"
    }

  # aws_iam_role_policy_attachment.lambda_vpc_access will be created
  + resource "aws_iam_role_policy_attachment" "lambda_vpc_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "recruit-service-board-lambda-execution"
    }

  # aws_lambda_function.migrate_function will be created
  + resource "aws_lambda_function" "migrate_function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "lambda_binary.zip"
      + function_name                  = "recruit-service-board-migrate"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                 

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

 + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Private Subnet 1a"
        }
      + tags_all                                       = {
          + "Name" = "Private Subnet 1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Private Subnet 1c"
        }
      + tags_all                                       = {
          + "Name" = "Private Subnet 1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Public Subnet 1a"
        }
      + tags_all                                       = {
          + "Name" = "Public Subnet 1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Public Subnet 1c"
        }
      + tags_all                                       = {
          + "Name" = "Public Subnet 1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "aws-ecs-terraform"
        }
      + tags_all                             = {
          + "Name" = "aws-ecs-terraform"
        }
    }

Plan: 58 to add, 0 to change, 0 to destroy.
aws_iam_role.ecs: Creating...
aws_ecs_cluster.ecs_cluster: Creating...
aws_api_gateway_rest_api.api: Creating...
aws_ecr_repository.ecr_repository: Creating...
aws_iam_role.lambda_execution_role: Creating...
aws_cloudwatch_log_group.cloudwatch_log_group: Creating...
aws_iam_policy.ssm_get_parameter: Creating...
module.vpc.aws_vpc.this[0]: Creating...
aws_iam_role.ecs_task: Creating...
aws_iam_policy.ssm_get_parameter: Creation complete after 1s [id=arn:aws:iam::113713103169:policy/recruit-service-board-ssm-get-parameter]
aws_iam_role.ecs_task: Creation complete after 1s [id=recruit-service-board-ecs-task]
aws_iam_role_policy_attachment.ecs_task_ssm_get_parameter: Creating...
aws_iam_role.ecs: Creation complete after 1s [id=recruit-service-board-ecs]
aws_iam_role_policy_attachment.ecs_basic: Creating...
aws_iam_role.lambda_execution_role: Creation complete after 1s [id=recruit-service-board-lambda-execution]
aws_iam_role_policy_attachment.lambda_vpc_access: Creating...
aws_iam_role_policy_attachment.lambda_basic_execution: Creating...
aws_iam_role_policy_attachment.ecs_task_ssm_get_parameter: Creation complete after 0s [id=recruit-service-board-ecs-task-20231001055513103000000001]
aws_ecr_repository.ecr_repository: Creation complete after 1s [id=recruit-service-board]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_iam_role_policy_attachment.lambda_basic_execution: Creation complete after 0s [id=recruit-service-board-lambda-execution-20231001055513149300000003]
aws_iam_role_policy_attachment.ecs_basic: Creation complete after 0s [id=recruit-service-board-ecs-20231001055513148200000002]
aws_iam_role_policy_attachment.lambda_vpc_access: Creation complete after 0s [id=recruit-service-board-lambda-execution-20231001055513152400000004]
aws_cloudwatch_log_group.cloudwatch_log_group: Creation complete after 1s [id=/aws/ecs/recruit-service-board]
aws_ecs_task_definition.ecs_task_definition: Creating...
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 0s [id=recruit-service-board]
aws_ecs_task_definition.ecs_task_definition: Creation complete after 1s [id=recruit-service-board]
aws_api_gateway_rest_api.api: Creation complete after 2s [id=9unjdz5kol]
aws_api_gateway_resource.resource: Creating...
aws_api_gateway_resource.resource: Creation complete after 0s [id=v473i0]
aws_api_gateway_method.method: Creating...
aws_api_gateway_method.method: Creation complete after 0s [id=agm-9unjdz5kol-v473i0-POST]
aws_ecs_cluster.ecs_cluster: Still creating... [10s elapsed]
module.vpc.aws_vpc.this[0]: Still creating... [10s elapsed]
aws_ecs_cluster.ecs_cluster: Creation complete after 12s [id=arn:aws:ecs:ap-northeast-1:113713103169:cluster/recruit-service-board]
module.vpc.aws_vpc.this[0]: Creation complete after 13s [id=vpc-06f5e5a957f3b6f73]
module.vpc.aws_route_table.private[0]: Creating...
module.vpc.aws_subnet.private[0]: Creating...
module.vpc.aws_internet_gateway.this[0]: Creating...
module.vpc.aws_default_route_table.default[0]: Creating...
module.vpc.aws_subnet.private[1]: Creating...
module.vpc.aws_subnet.public[1]: Creating...
module.vpc.aws_route_table.private[1]: Creating...
module.vpc.aws_default_network_acl.this[0]: Creating...
module.vpc.aws_route_table.public[0]: Creating...
module.vpc.aws_default_security_group.this[0]: Creating...
module.vpc.aws_default_route_table.default[0]: Creation complete after 1s [id=rtb-095797121576906de]
module.vpc.aws_subnet.public[0]: Creating...
module.vpc.aws_subnet.private[0]: Creation complete after 1s [id=subnet-0905e9b6b76270463]
aws_subnet.rds_subnet_a: Creating...
module.vpc.aws_route_table.private[0]: Creation complete after 1s [id=rtb-0d8f042e62db730eb]
aws_lb_target_group.target_group: Creating...
module.vpc.aws_subnet.public[1]: Creation complete after 1s [id=subnet-0d9c11e47af125138]
aws_security_group.lambda_sg: Creating...
module.vpc.aws_internet_gateway.this[0]: Creation complete after 1s [id=igw-0a7aebb1412583f7c]
aws_security_group.ecs: Creating...
module.vpc.aws_route_table.public[0]: Creation complete after 1s [id=rtb-0ffd58460a2ea6296]
aws_subnet.rds_subnet_d: Creating...
module.vpc.aws_route_table.private[1]: Creation complete after 1s [id=rtb-0e5d3dcb83556af33]
aws_security_group.alb: Creating...
module.vpc.aws_subnet.private[1]: Creation complete after 1s [id=subnet-04c77bbc01ef7683b]
module.vpc.aws_eip.nat[1]: Creating...
aws_subnet.rds_subnet_a: Creation complete after 1s [id=subnet-0dc55f8101f433a4c]
module.vpc.aws_eip.nat[0]: Creating...
module.vpc.aws_subnet.public[0]: Creation complete after 1s [id=subnet-064815ff95dd6eba5]
module.vpc.aws_route.public_internet_gateway[0]: Creating...
module.vpc.aws_default_network_acl.this[0]: Creation complete after 2s [id=acl-05791fa117bbda01f]
module.vpc.aws_route_table_association.private[0]: Creating...
module.vpc.aws_eip.nat[1]: Creation complete after 1s [id=eipalloc-021dc62b48e611ee1]
module.vpc.aws_route_table_association.private[1]: Creating...
aws_subnet.rds_subnet_d: Creation complete after 1s [id=subnet-0ee82724411b3bec5]
module.vpc.aws_route_table_association.public[1]: Creating...
module.vpc.aws_default_security_group.this[0]: Creation complete after 3s [id=sg-0416d209fba5a524b]
module.vpc.aws_route_table_association.public[0]: Creating...
module.vpc.aws_route_table_association.private[0]: Creation complete after 1s [id=rtbassoc-0ac4fe2dbf0fcc0a6]
aws_db_subnet_group.my_db_subnet_group: Creating...
module.vpc.aws_route_table_association.private[1]: Creation complete after 1s [id=rtbassoc-0d777819c3d70f9e1]
module.vpc.aws_route.public_internet_gateway[0]: Creation complete after 1s [id=r-rtb-0ffd58460a2ea62961080289494]
module.vpc.aws_route_table_association.public[1]: Creation complete after 1s [id=rtbassoc-047828f8ab18fc7f5]
module.vpc.aws_eip.nat[0]: Creation complete after 1s [id=eipalloc-087c5ab13daa65283]
module.vpc.aws_nat_gateway.this[0]: Creating...
module.vpc.aws_nat_gateway.this[1]: Creating...
aws_lb_target_group.target_group: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:targetgroup/recruit-service-board-tg/dd0f05ddbd389c9a]
module.vpc.aws_route_table_association.public[0]: Creation complete after 0s [id=rtbassoc-0e907bbbb064cba05]
aws_security_group.lambda_sg: Creation complete after 3s [id=sg-0d7e8706500f43bc0]
aws_security_group_rule.lambda_access_rds: Creating...
aws_lambda_function.migrate_function: Creating...
aws_security_group.ecs: Creation complete after 3s [id=sg-01ad42c8b43d072f8]
aws_security_group.rds: Creating...
aws_security_group.alb: Creation complete after 3s [id=sg-0425ad35581cc3eac]
aws_security_group_rule.ecs_from_alb: Creating...
aws_lb.alb: Creating...
aws_security_group_rule.lambda_access_rds: Creation complete after 0s [id=sgrule-4219928612]
aws_db_subnet_group.my_db_subnet_group: Creation complete after 1s [id=recruit-service-board-db-subnet-group]
aws_security_group_rule.ecs_from_alb: Creation complete after 1s [id=sgrule-561344518]
aws_security_group.rds: Creation complete after 3s [id=sg-03f1950bb7e270e24]
aws_db_instance.my_db_instance: Creating...
module.vpc.aws_nat_gateway.this[0]: Still creating... [10s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [10s elapsed]
aws_lambda_function.migrate_function: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [10s elapsed]
aws_db_instance.my_db_instance: Still creating... [10s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [20s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [20s elapsed]
aws_lambda_function.migrate_function: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_db_instance.my_db_instance: Still creating... [20s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [30s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [30s elapsed]
aws_lambda_function.migrate_function: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_db_instance.my_db_instance: Still creating... [30s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [40s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [40s elapsed]
aws_lambda_function.migrate_function: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_db_instance.my_db_instance: Still creating... [40s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [50s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [50s elapsed]
aws_lambda_function.migrate_function: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_db_instance.my_db_instance: Still creating... [50s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m0s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m0s elapsed]
aws_lambda_function.migrate_function: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_db_instance.my_db_instance: Still creating... [1m0s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m10s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m10s elapsed]
aws_lambda_function.migrate_function: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_db_instance.my_db_instance: Still creating... [1m10s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m20s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m20s elapsed]
aws_lambda_function.migrate_function: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_db_instance.my_db_instance: Still creating... [1m20s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m30s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m30s elapsed]
aws_lambda_function.migrate_function: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_db_instance.my_db_instance: Still creating... [1m30s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m40s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m40s elapsed]
aws_lambda_function.migrate_function: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_db_instance.my_db_instance: Still creating... [1m40s elapsed]
module.vpc.aws_nat_gateway.this[1]: Creation complete after 1m46s [id=nat-0130c634fc0ccee74]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m50s elapsed]
aws_lambda_function.migrate_function: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_db_instance.my_db_instance: Still creating... [1m50s elapsed]
module.vpc.aws_nat_gateway.this[0]: Creation complete after 1m56s [id=nat-0983371354ce01969]
module.vpc.aws_route.private_nat_gateway[1]: Creating...
module.vpc.aws_route.private_nat_gateway[0]: Creating...
module.vpc.aws_route.private_nat_gateway[1]: Creation complete after 1s [id=r-rtb-0e5d3dcb83556af331080289494]
module.vpc.aws_route.private_nat_gateway[0]: Creation complete after 1s [id=r-rtb-0d8f042e62db730eb1080289494]
aws_lambda_function.migrate_function: Still creating... [2m0s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_db_instance.my_db_instance: Still creating... [2m0s elapsed]
aws_lambda_function.migrate_function: Creation complete after 2m4s [id=recruit-service-board-migrate]
aws_lambda_permission.apigw: Creating...
aws_api_gateway_integration.integration: Creating...
aws_api_gateway_integration.integration: Creation complete after 0s [id=agi-9unjdz5kol-v473i0-POST]
aws_api_gateway_deployment.deployment: Creating...
aws_lambda_permission.apigw: Creation complete after 0s [id=terraform-20231001055732573600000008]
aws_api_gateway_deployment.deployment: Creation complete after 1s [id=tm7ug4]
aws_lb.alb: Still creating... [2m10s elapsed]
aws_db_instance.my_db_instance: Still creating... [2m10s elapsed]
aws_lb.alb: Still creating... [2m20s elapsed]
aws_db_instance.my_db_instance: Still creating... [2m20s elapsed]
aws_lb.alb: Creation complete after 2m24s [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:loadbalancer/app/recruit-service-board-alb/9bef755c32eda948]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:listener/app/recruit-service-board-alb/9bef755c32eda948/577cff3379e73f60]
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:listener-rule/app/recruit-service-board-alb/9bef755c32eda948/577cff3379e73f60/79f2cf154c2da333]
aws_ecs_service.ecs_service: Creating...
aws_ecs_service.ecs_service: Creation complete after 1s [id=arn:aws:ecs:ap-northeast-1:113713103169:service/recruit-service-board/recruit-service-board]
aws_db_instance.my_db_instance: Still creating... [2m30s elapsed]
aws_db_instance.my_db_instance: Still creating... [2m40s elapsed]
aws_db_instance.my_db_instance: Still creating... [2m50s elapsed]
aws_db_instance.my_db_instance: Still creating... [3m0s elapsed]
aws_db_instance.my_db_instance: Still creating... [3m10s elapsed]
aws_db_instance.my_db_instance: Still creating... [3m20s elapsed]
aws_db_instance.my_db_instance: Still creating... [3m30s elapsed]
aws_db_instance.my_db_instance: Still creating... [3m40s elapsed]
aws_db_instance.my_db_instance: Still creating... [3m50s elapsed]
aws_db_instance.my_db_instance: Still creating... [4m0s elapsed]
aws_db_instance.my_db_instance: Still creating... [4m10s elapsed]
aws_db_instance.my_db_instance: Still creating... [4m20s elapsed]
aws_db_instance.my_db_instance: Still creating... [4m30s elapsed]
aws_db_instance.my_db_instance: Still creating... [4m40s elapsed]
aws_db_instance.my_db_instance: Creation complete after 4m47s [id=db-XG7T25E7WMGB7S7ISJKIGGR2DI]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 58 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":28,"Program":"tfcmt","SHA1":"ac9ae0432494218507bdaab7f873e3418dda37a3","Vars":{},"WorkflowName":"Terraform"} -->